import React, { Component } from "react";

class Content extends Component {
  toggleBackgroundColor = (event, class1, class2) => {
    const element = event.target;
    if (element.classList.contains(class1)) {
      element.classList.remove(class1);
      element.classList.add(class2);
    } else if (element.classList.contains(class2)) {
      element.classList.remove(class2);
      element.classList.add(class1);
    } else {
      element.classList.add(class1);
    }
  };

  render() {
    return (
      <div>
        <h2>Кругляк Артем Ігорович</h2>
        <p>
          <strong>Місце народження:</strong> 16 травня, 2005 року, м. Острог
        </p>
        <p>
          <strong>Освіта:</strong> ЗОШ №1, м. Острог; НТУУ "КПІ", м. Київ
        </p>

        <h3>Хобі:</h3>
        <ul>
          <li>Бодібілдинг</li>
          <li>Ютуб</li>
          <li>Кулінарія</li>
        </ul>

        <h3>Улюблені аніме:</h3>
        <ol>
          <li>"Ван Піс"</li>
          <li>"Наруто"</li>
          <li>"Моя геройська академія"</li>
        </ol>

        <h3
          id="target7"
          onClick={(e) =>
            this.toggleBackgroundColor(e, "blue-background", "green-background")
          }
        >
          Опис улюбленого міста: Київ
        </h3>
        <p
          id="target8"
          onClick={(e) =>
            this.toggleBackgroundColor(e, "green-background", "blue-background")
          }
        >
          Київ — це столиця та найбільше місто України, відоме своєю багатою
          історією, мальовничими краєвидами та значущістю для культурного і
          духовного життя країни. Засноване більше ніж півтори тисячі років
          тому, місто несе в собі сліди різних історичних епох, які
          відображаються у його архітектурі та пам'ятках.
        </p>

        <p>
          Однією з найвідоміших пам'яток Києва є Софійський собор, що внесений
          до списку Світової спадщини ЮНЕСКО. Його золоті куполи і старовинні
          фрески приваблюють як туристів, так і жителів міста. Поруч розташована
          Києво-Печерська лавра — старовинний монастирський комплекс, який є
          важливим духовним осередком.
        </p>

        <p>
          Хрещатик, головна вулиця міста, вражає своїм широким проспектом та
          архітектурою радянської епохи, а Майдан Незалежності, центральна площа
          Києва, відома як символ свободи та місце, де відбувалися визначні
          події в новітній історії України.
        </p>

        <p>
          Київ також славиться своїми зеленими зонами та парками, такими як
          Маріїнський парк та Ботанічний сад імені Гришка. Вони пропонують
          спокійні місця для прогулянок та насолоди природою. Окрім цього, місто
          розташоване на берегах Дніпра, що надає йому додаткового шарму завдяки
          мальовничим набережним та пляжам.
        </p>

        <p>
          Завдяки своїй багатогранній культурі, Київ приваблює численних
          відвідувачів сучасними музеями, театрами та концертними залами. Місто
          відоме своїми ресторанними традиціями та популярними закладами, де
          можна спробувати як українську, так і міжнародну кухню.
        </p>
      </div>
    );
  }
}

export default Content;
